Ran Plan for dir: `terragrunt/kubernetes/longhorn` workspace: `terragrunt_kubernetes_longhorn`

<details><summary>Show Output</summary>

```diff
Authenticated

01:01:17.727 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/zK29vdtq2ilx7rnyymVLrsnozjw/ZZ-ojhMnkqsCDnSqkNv6h9yw-dk
01:01:17.753 INFO   tofu: Initializing the backend...
01:01:18.030 INFO   tofu: Initializing provider plugins...
01:01:18.030 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:18.202 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:18.336 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:18.473 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:18.593 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:18.693 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:18.816 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:18.897 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:19.037 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:19.112 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:19.133 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:19.144 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:19.178 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:19.214 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:19.235 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
01:01:19.272 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:19.272 INFO   tofu: OpenTofu has been successfully initialized!
01:01:19.919 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:19.919 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:19.919 STDOUT tofu:   ~ update in-place
01:01:19.919 STDOUT tofu: OpenTofu will perform the following actions:
01:01:19.919 STDOUT tofu:   # helm_release.longhorn will be updated in-place
01:01:19.919 STDOUT tofu:   ~ resource "helm_release" "longhorn" {
01:01:19.919 STDOUT tofu:       ~ id                         = "longhorn" -> (known after apply)
01:01:19.919 STDOUT tofu:       ~ metadata                   = {
01:01:19.919 STDOUT tofu:           ~ app_version    = "v1.10.1" -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ chart          = "longhorn" -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ first_deployed = 1759114852 -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ last_deployed  = 1764773028 -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ name           = "longhorn" -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ namespace      = "longhorn-system" -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ revision       = 2 -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ values         = jsonencode(
01:01:19.919 STDOUT tofu:                 {
01:01:19.919 STDOUT tofu:                   - defaultBackupStore = {
01:01:19.919 STDOUT tofu:                       - backupTarget                 = "s3://longhorn@us-east-1/"
01:01:19.919 STDOUT tofu:                       - backupTargetCredentialSecret = "longhorn-secrets"
01:01:19.919 STDOUT tofu:                     }
01:01:19.919 STDOUT tofu:                   - defaultSettings    = {
01:01:19.919 STDOUT tofu:                       - systemManagedComponentsNodeSelector = "!node-role.kubernetes.io/master"
01:01:19.919 STDOUT tofu:                     }
01:01:19.919 STDOUT tofu:                   - longhornUI         = {
01:01:19.919 STDOUT tofu:                       - replicas = 1
01:01:19.919 STDOUT tofu:                     }
01:01:19.919 STDOUT tofu:                   - persistence        = {
01:01:19.919 STDOUT tofu:                       - defaultClassReplicaCount = 2
01:01:19.919 STDOUT tofu:                     }
01:01:19.919 STDOUT tofu:                 }
01:01:19.919 STDOUT tofu:             ) -> (known after apply)
01:01:19.919 STDOUT tofu:           ~ version        = "1.10.1" -> (known after apply)
01:01:19.919 STDOUT tofu:         } -> (known after apply)
01:01:19.919 STDOUT tofu:         name                       = "longhorn"
01:01:19.919 STDOUT tofu:       ~ version                    = "1.10.1" -> "1.10.2"
01:01:19.919 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:19.919 STDOUT tofu:     }
01:01:19.919 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:19.919 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Flonghorn%252Fterragrunt_kubernetes_longhorn)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```